#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>
```

Success! The configuration is valid.


```
</details>
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.common: Reading...
data.google_service_account_access_token.default: Reading...
data.google_service_account_access_token.default: Read complete after 0s [id=projects/-/serviceAccounts/terraform@youtube-data-api-385206.iam.gserviceaccount.com]
module.enable_google_apis.google_project_service.project_services["iam.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iam.googleapis.com]
module.enable_google_apis.google_project_service.project_services["sts.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/sts.googleapis.com]
module.enable_google_apis.google_project_service.project_services["artifactregistry.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/artifactregistry.googleapis.com]
module.enable_google_apis.google_project_service.project_services["iamcredentials.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/iamcredentials.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudresourcemanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudresourcemanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["storage.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/storage.googleapis.com]
module.enable_google_apis.google_project_service.project_services["pubsub.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/pubsub.googleapis.com]
module.enable_google_apis.google_project_service.project_services["bigquery.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/bigquery.googleapis.com]
module.enable_google_apis.google_project_service.project_services["cloudscheduler.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/cloudscheduler.googleapis.com]
data.terraform_remote_state.common: Read complete after 3s
module.enable_google_apis.google_project_service.project_services["run.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/run.googleapis.com]
module.enable_google_apis.google_project_service.project_services["secretmanager.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/secretmanager.googleapis.com]
module.enable_google_apis.google_project_service.project_services["youtube.googleapis.com"]: Refreshing state... [id=youtube-data-api-385206/youtube.googleapis.com]
module.pubsub_topic.google_pubsub_topic.main: Refreshing state... [id=projects/youtube-data-api-385206/topics/dev-youtube-data-api]
module.storage.google_storage_bucket.bucket: Refreshing state... [id=dev-youtube-data-api-385206-bucket]
module.pubsub_topic.google_pubsub_topic_iam_member.topic_publisher_role: Refreshing state... [id=projects/youtube-data-api-385206/topics/dev-youtube-data-api/roles/pubsub.publisher/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.pubsub_topic.google_pubsub_topic.main_dead_letter: Refreshing state... [id=projects/youtube-data-api-385206/topics/dev-dev-youtube-data-api-dlq]
module.storage.google_storage_bucket_iam_member.member: Refreshing state... [id=b/dev-youtube-data-api-385206-bucket/roles/storage.admin/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]
module.run.google_cloud_run_v2_service.api: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/services/dev-youtube-data-api-api]
module.run.google_cloud_run_service_iam_member.api_invoker: Refreshing state... [id=v1/projects/youtube-data-api-385206/locations/asia-northeast1/services/dev-youtube-data-api-api/roles/run.invoker/serviceAccount:cloudrun-invoker@youtube-data-api-385206.iam.gserviceaccount.com]
module.scheduler.google_cloud_scheduler_job.invoke-transfer: Refreshing state... [id=projects/youtube-data-api-385206/locations/asia-northeast1/jobs/dev-invoke-transfer]
module.pubsub_subscription.google_pubsub_subscription.main: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub]
module.pubsub_subscription.google_pubsub_subscription_iam_member.subscription_subscriber_role: Refreshing state... [id=projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub/roles/pubsub.subscriber/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.pubsub_subscription.google_pubsub_subscription.main must be replaced
-/+ resource "google_pubsub_subscription" "main" {
      ~ effective_labels             = {} -> (known after apply)
      - enable_exactly_once_delivery = false -> null
      ~ id                           = "projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub" -> (known after apply)
      - labels                       = {} -> null
      ~ name                         = "youtube-data-api-sub" -> "dev-youtube-data-api-sub" # forces replacement
      - retain_acked_messages        = false -> null
      ~ terraform_labels             = {} -> (known after apply)
        # (6 unchanged attributes hidden)

      ~ push_config {
          - attributes    = {} -> null
            # (1 unchanged attribute hidden)

            # (1 unchanged block hidden)
        }

      ~ retry_policy {
          ~ maximum_backoff = "600s" -> (known after apply)
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.pubsub_subscription.google_pubsub_subscription_iam_member.subscription_subscriber_role must be replaced
-/+ resource "google_pubsub_subscription_iam_member" "subscription_subscriber_role" {
      ~ etag         = "BwYaXWXMNXY=" -> (known after apply)
      ~ id           = "projects/youtube-data-api-385206/subscriptions/youtube-data-api-sub/roles/pubsub.subscriber/serviceAccount:youtube-data-api-sa@youtube-data-api-385206.iam.gserviceaccount.com" -> (known after apply)
      + project      = (known after apply)
      ~ subscription = "youtube-data-api-sub" -> "dev-youtube-data-api-sub" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.run.google_cloud_run_v2_service.api will be updated in-place
  ~ resource "google_cloud_run_v2_service" "api" {
        id                      = "projects/youtube-data-api-385206/locations/asia-northeast1/services/dev-youtube-data-api-api"
        name                    = "dev-youtube-data-api-api"
        # (30 unchanged attributes hidden)

      ~ template {
            # (9 unchanged attributes hidden)

          ~ containers {
              ~ image       = "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/dev-youtube-data-api-repository/youtube-data-api:98e7e63fd751fb4d2d6190ae5eb25bc10667afad" -> "asia-northeast1-docker.pkg.dev/youtube-data-api-385206/dev-youtube-data-api-repository/youtube-data-api:fdd8fa06fb49e35623ac53c7d8543f6567345f12"
                name        = null
                # (4 unchanged attributes hidden)

                # (10 unchanged blocks hidden)
            }

            # (1 unchanged block hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pusher: @Kamegrueon, Action: `pull_request`, Working Directory: ``, Workflow: `cicd`*